#include<stdio.h>
int main()
{	int m,a,b,c1,c2,c3,c4,c5;
	scanf("%d",&m);
	c5=m%10;
	c1=m/10000;
	c2=(m-c1*10000)/1000;
	c3=(m-c1*10000-c2*1000)/100;
	c4=(m-c1*10000-c2*1000-c3*100)/10;
	if(c1>0) printf("5\n%d %d %d %d %d\n%d%d%d%d%d",c1,c2,c3,c4,c5,c5,c4,c3,c2,c1);
	else if(c1==0,c2>0) printf("4\n%d %d %d %d\n%d%d%d%d",c2,c3,c4,c5,c5,c4,c3,c2);
	else if(c1==0,c2==0,c3>0) printf("3\n%d %d %d\n%d%d%d",c3,c4,c5,c5,c4,c3);
	else if(c1==0,c2==0,c3==0,c4>0) printf("2\n%d %d\n%d%d",c4,c5,c5,c4);
	else if(c1==0,c2==0,c3==0,c4==0,c5>0) printf("1\n%d\n%d",c5,c5);
	else printf("0\n0\n0");
	return 0;

	
}
/*题目描述
给出一个不多于5位的正整数，要求如下：

1、求出它是几位数

2、分别输出每一位上的数字，数字之间用1个空格隔开

3、按逆序输出各位数字，例如原数为321,应输出123

输入
输入一个不大于5位的正整数

输出
第一行输出位数

第二行从左到右输出每一位上的数字，数字间用一个空格分开，注意最后一个数字后面没有空格

第三行按逆序输出这个数

样例输入
12345
样例输出
5
1 2 3 4 5
54321*/
