#include<stdio.h>
int main()
{	int i,a=0,n=0,k=0,h=0;
	char c[100];
	gets(c);
	for(i=0;i<100;i++)
	{	if((c[i]>=65&&c[i]<=90)||(c[i]>=97&&c[i]<=122))
			a++;
		else if(c[i]>=48&&c[i]<=57)
			n++;
		else if(c[i]==' ')
			k++;
		else if((c[i]>=33&&c[i]<=47)||(c[i]>=58&&c[i]<=64)||(c[i]>=91&&c[i]<=96)||(c[i]>=123&&c[i]<=127))
			h++;
		else if(c[i]='\n')
			break;	
	}
	printf("%d %d %d %d",a,n,k,h);
	return 0;
}
/*题目描述
编写一函数，由实参传来一个字符串，统计此字符串中字母、数字、空格和其它字符的个数，在主函数中输入字符串以及输出上述结果。 只要结果，别输出什么提示信息。
输入
一行字符串
输出
统计数据，4个数字，空格分开。
样例输入
!@#$%^QWERT    1234567
样例输出
5 7 4 6 */
